import { InlineKeyboard } from "grammy";

export const examAnxiety = async (ctx) => {
  await ctx.answerCallbackQuery();
  await ctx.editMessageText(
    'Похоже, экзамены вызывают у тебя напряжение. \nДавай подберём технику, которая поможет успокоиться и сфокусироваться.',
    {
      reply_markup: new InlineKeyboard()
        .text('🔄 Показать случайную технику', 'examRandom').row()
        .text('📚 Посмотреть список техник', 'examList').row()
        .text('📝 Мини-тест (подбор индивидуальной техники)', 'examTest').row()
        .text('🔙 Назад', 'menu').row()
    },
  );
};
